In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [5]:
#import pandas testing utility
import pandas.testing as tm; tm.N = 3

In [17]:
#create a data to play with
df = DataFrame({'player':['A','A','B','A'],
                'games': [1, 2, 3, 4],
                'pts': [5, 7, 13, 12]})
df

  player  games  pts
0      A      1    5
1      A      2    7
2      B      3   13
3      A      4   12

In [18]:
df_pv = df.pivot('player','games','pts')
df_pv

games     1    2     3     4
player
A       5.0  7.0   NaN  12.0
B       NaN  NaN  13.0   NaN

In [19]:
#now use replace to change NaN to 0
df_pv.replace(np.NaN,0)

games     1    2     3     4
player
A       5.0  7.0   0.0  12.0
B       0.0  0.0  13.0   0.0